# 实习二：数据库约束设计

成员：蔡鑫豪2100013113 马啸宇2100013083 章毅2100013107

In [1]:
%load_ext sql

In [2]:
import pymysql 
pymysql.install_as_MySQLdb()
%sql mysql://stu2100013113:stu2100013113@162.105.146.37:43306

In [3]:
%sql use stu2100013113;

 * mysql://stu2100013113:***@162.105.146.37:43306
0 rows affected.

[]

# 基本约束设计

In [4]:
%%sql
set @@foreign_key_checks=0;
drop table if exists Emp;
CREATE TABLE Emp (
    eno INT(4) ZEROFILL AUTO_INCREMENT PRIMARY KEY,
    ename VARCHAR(50),
    birthday DATE,
    level INT DEFAULT 3 CHECK (level >= 1 AND level <= 5),
    position ENUM('教师', '教务', '会计', '秘书'),
    salary DECIMAL(10, 2) CHECK (salary >= 2000 AND salary <= 200000)
);

drop table if exists Dept;
CREATE TABLE Dept (
    dno INT(4) ZEROFILL AUTO_INCREMENT PRIMARY KEY,
    dname ENUM('数学学院', '计算机学院', '智能学院', '电子学院', '元培学院'),
    budget DECIMAL(10, 2)
);

ALTER TABLE Emp
ADD COLUMN ddno INT(4) ZEROFILL,
ADD FOREIGN KEY (ddno) REFERENCES Dept(dno);

ALTER TABLE Dept
ADD COLUMN manager INT(4) ZEROFILL,
ADD FOREIGN KEY (manager) REFERENCES Emp(eno);
set @@foreign_key_checks=1;

 * mysql://stu2100013113:***@162.105.146.37:43306
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.

[]

Foreign Key的三种定义方式分别为restrict, cascade和set null。
默认情况下（现在使用的定义）是restrict，此时如果要删除/更新的基本关系的主码被一个外码依赖，就无法删除/更新。
cascade如果遇到上述情况，会同时删除/更新所有外码与对应的主码所在的行。
set null遇到上述情况，会把对应的外码设置为空。

In [5]:
%%sql
###测试插入数据
SELECT ROW_COUNT();
INSERT INTO Emp(ename, birthday, level, position, salary) VALUES ('张三', '1980-01-01', 4, '教师', 15000);
INSERT INTO Dept(dname, budget, manager) VALUES ('元培学院', 100000, 0001);

UPDATE Emp
SET ddno = 1
WHERE eno = 1;

INSERT INTO Emp(ename, birthday, level, position, salary, ddno) VALUES ('李四', '1985-05-05', 3, '教务', 8000, 1);
INSERT INTO Emp(ename, birthday, level, position, salary, ddno) VALUES ('王五', '1990-10-10', 1, '秘书', 3000, 1);

 * mysql://stu2100013113:***@162.105.146.37:43306
0 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [6]:
%sql select * from Emp

 * mysql://stu2100013113:***@162.105.146.37:43306
3 rows affected.

[(1, '张三', datetime.date(1980, 1, 1), 4, '教师', Decimal('15000.00'), 1),
 (2, '李四', datetime.date(1985, 5, 5), 3, '教务', Decimal('8000.00'), 1),
 (3, '王五', datetime.date(1990, 10, 10), 1, '秘书', Decimal('3000.00'), 1)]

In [7]:
%sql select * from Dept

 * mysql://stu2100013113:***@162.105.146.37:43306
1 rows affected.

[(1, '元培学院', Decimal('100000.00'), 1)]

# 中级约束设计

In [8]:
%%sql
###插入互相参照的两行
set @@foreign_key_checks=0;

SELECT ROW_COUNT();
INSERT INTO Emp(ename, birthday, level, position, salary) VALUES ('赵六', '1999-01-01', 5, '教师', 30000);
INSERT INTO Dept(dname, budget, manager) VALUES ('电子学院', 300000, 0004);

UPDATE Emp
SET ddno = 2
WHERE eno = 4;

set @@foreign_key_checks=1;

 * mysql://stu2100013113:***@162.105.146.37:43306
0 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
0 rows affected.

[]

In [9]:
%sql select * from Emp

 * mysql://stu2100013113:***@162.105.146.37:43306
4 rows affected.

[(1, '张三', datetime.date(1980, 1, 1), 4, '教师', Decimal('15000.00'), 1),
 (2, '李四', datetime.date(1985, 5, 5), 3, '教务', Decimal('8000.00'), 1),
 (3, '王五', datetime.date(1990, 10, 10), 1, '秘书', Decimal('3000.00'), 1),
 (4, '赵六', datetime.date(1999, 1, 1), 5, '教师', Decimal('30000.00'), 2)]

In [10]:
%sql select * from Dept

 * mysql://stu2100013113:***@162.105.146.37:43306
2 rows affected.

[(1, '元培学院', Decimal('100000.00'), 1), (2, '电子学院', Decimal('300000.00'), 4)]

测试salary与level的行级约束，设置触发器。

In [11]:
%%sql
DROP TRIGGER IF EXISTS check_salary_level;
CREATE TRIGGER check_salary_level
BEFORE INSERT ON Emp
FOR EACH ROW
BEGIN
    IF NEW.salary < 4000 AND NEW.level <> 1 THEN
        SIGNAL SQLSTATE '45000' SET MESSAGE_TEXT = 'Salary is in the wrong range for level 1';
    ELSEIF NEW.salary >= 4000 AND NEW.salary < 8000 AND NEW.level <> 2 THEN
        SIGNAL SQLSTATE '45000' SET MESSAGE_TEXT = 'Salary is in the wrong range for level 2';
    ELSEIF NEW.salary >= 8000 AND NEW.salary < 12000 AND NEW.level <> 3 THEN
        SIGNAL SQLSTATE '45000' SET MESSAGE_TEXT = 'Salary is in the wrong range for level 3';
    ELSEIF NEW.salary >= 12000 AND NEW.salary < 16000 AND NEW.level <> 4 THEN
        SIGNAL SQLSTATE '45000' SET MESSAGE_TEXT = 'Salary is in the wrong range for level 4';
    ELSEIF NEW.salary >= 16000 AND NEW.level <> 5 THEN
        SIGNAL SQLSTATE '45000' SET MESSAGE_TEXT = 'Salary is in the wrong range for level 5';
    END IF;
END;

 * mysql://stu2100013113:***@162.105.146.37:43306
0 rows affected.
0 rows affected.

[]

尝试插入一个salary与level不匹配的插入，插入会被禁止。

In [12]:
%%sql
INSERT INTO Emp(ename, birthday, level, position, salary, ddno) VALUES ('高松灯', '1985-05-05', 4, '教务', 8000, 1);

 * mysql://stu2100013113:***@162.105.146.37:43306
(pymysql.err.OperationalError) (1644, 'Salary is in the wrong range for level 3')
[SQL: INSERT INTO Emp(ename, birthday, level, position, salary, ddno) VALUES ('高松灯', '1985-05-05', 4, '教务', 8000, 1);]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

输入员工号，输出对应的智能码。

In [13]:
%%sql

DROP PROCEDURE IF EXISTS GetEmployeeInfo;
CREATE PROCEDURE GetEmployeeInfo(IN myeno INT(4) zerofill, OUT info VARCHAR(255))
BEGIN
    DECLARE mydno INT(4);
    DECLARE mybirthday YEAR;
    DECLARE mylevel INT;
    DECLARE myposition VARCHAR(50);
    DECLARE mymanager CHAR(4);
    DECLARE myposition_code CHAR(2);
    SELECT ddno, YEAR(birthday), level, position INTO mydno, mybirthday, mylevel, myposition FROM Emp WHERE eno = myeno;
    SELECT manager INTO mymanager FROM Dept WHERE dno = mydno;
    
    SET myposition_code = CASE
        WHEN myposition = '教师' THEN '01'
        WHEN myposition = '教务' THEN '02'
        WHEN myposition = '会计' THEN '03'
        WHEN myposition = '秘书' THEN '04'
        ELSE '00'
    END;
    
    SET info = CONCAT(LPAD(myeno, 4, '0'), LPAD(mydno, 4, '0'), mybirthday, LPAD(mylevel, 2, '0'), myposition_code, LPAD(mymanager, 4, '0'));
END;

 * mysql://stu2100013113:***@162.105.146.37:43306
0 rows affected.
0 rows affected.

[]

In [14]:
%%sql


CALL GetEmployeeInfo(0002, @info);
SELECT @info;

 * mysql://stu2100013113:***@162.105.146.37:43306
1 rows affected.
1 rows affected.

[('00020001198503020001',)]